Repository: AlexanderJohr/spreadsheet-data-extractor-paper
Catalog: spreadsheet_data_extractor/lib/l10n/app_*.arb
Languages: de, es

# appTitle
source: Spreadsheet Describer and Data Extractor
de: Smedahidesdex
es: Descriptor de hoja de cálculo y extractor de datos

# taskPageTitle
source: Import Excel Files
de: Importiere Excel Dateien
es: Importar archivos de Excel

# firstAppCallIntroTitle
source: Spreadsheet Metadata Hierarchy Describer and Data Extractor 0.12.0 - For internal use only
de: Spreadsheet Metadata Hierarchy Describer and Data Extractor 0.12.0 - Nur zur internen Verwendung
es: Spreadsheet Metadata Hierarchy Describer and Data Extractor 0.12.0 - Sólo para uso interno

# acceptButtonText
source: accept
de: akzeptieren
es: aceptar

# selectedDataIsNotExcelErrorText
source: Error: The selected file to attach the data is not an Excel file
de: Fehler: Ausgewählte Datei zum Anhängen der Daten ist keine Excel Datei
es: Error: El archivo seleccionado para adjuntar datos no es un archivo de Excel

# fileExistsText
source: Successfully appended {linesAppended} line(s) to the existing lines in {filePath}
de: Erfolgreich {linesAppended} Zeilen an die bestehenden Zeilen in {filePath} angehängt
es: Se han añadido con éxito líneas {linesAppended} a las líneas existentes en {filePath}.

# fileDoesNotExistsText
source: Successfully saved {linesAppended} lines to new {filePath} file.
de: Erfolgreich {linesAppended} Zeile(n) in die neue Datei {filePath} gespeichert.
es: Guardadas con éxito las línea(s) {linesAppended} en el nuevo archivo {filePath}.

# taskParentHeaderTitle
source: tasks
de: Aufgaben
es: tareas

# importExcelFilesButtonText
source: import Excel files
de: Importiere Excel Dateien
es: importar archivos de Excel

# copyConfigButtonText
source: copy configuration
de: Kopiere Konfiguration
es: copiar configuración

# insertConfigButtonText
source: insert configuration
de: Füge Konfiguration ein
es: insertar configuración

# configSavedText
source: Configuration saved successfully.
de: Konfiguration erfolgreich gespeichert.
es: Configuración guardada correctamente.

# saveConfigButtonText
source: save configuration
de: Speichere Konfiguration
es: guardar configuración

# loadConfigButtonText
source: load configuration
de: Lade Konfiguration
es: configuración de carga

# importSheetsButtonText
source: import Excel sheets
de: Importiere Excel Sheets
es: importar hojas de Excel

# importAdditionalFilesButtonText
source: import additional files
de: Importiere zusätzliche Dateien
es: importar archivos adicionales

# copyExcelFileImportTaskButtonText
source: copy Excel file import task
de: Kopiere Exceldatei-Import Aufgabe
es: copiar tarea de importación de archivos Excel

# insertExcelFileImportTaskButtonText
source: insert Excel file import task
de: Füge Exceldatei-Import Aufgabe ein
es: insertar tarea de importación de archivos Excel

# noSheetSelectedText
source: click to select Excel sheet
de: Klicken um Excel Sheets zu Selektieren
es: haga clic para seleccionar hojas de Excel

# importCellsButtonText
source: import cells
de: Importiere Zellen
es: importar celdas de tabla

# copyWorksheetImportTaskButtonText
source: copy worksheet import task
de: Kopiere Arbeitsblatt-Import Aufgabe
es: copiar tarea de importación de hojas de cálculo

# insertWorksheetImportTaskButtonText
source: insert worksheet import task
de: Füge Arbeitsbeinlatt-Import Aufgabe ein
es: insertar tarea de importación de la hoja del tramo de trabajo

# noCellsSelectedText
source: click to select cells
de: Klicken um Excel Zellen zu Selektieren
es: haga clic para seleccionar celdas de Excel

# linkCellIndexBoxText
source: link cell index
de: Verknüpfe Zellenindex
es: índice de células de enlace

# useDefaultValueBoxText
source: use default value
de: Verwende vorgegebenen Wert
es: utilizar el valor por defecto

# copyCellSelectionButtonText
source: copy cell selection
de: Kopiere Zellen-Selektion
es: copiar selección de celdas

# copyTaskButtonText
source: copy task
de: Kopiere Aufgabe
es: copiar tarea

# duplicateTaskButtonText
source: duplicate task
de: Dupliziere Aufgabe
es: duplicar tarea

# insertCellSelectionButtonText
source: insert cell selection
de: Füge Zellen-Selektion ein
es: insertar selección de celdas

# insertTaskButtonText
source: insert task
de: Füge Aufgabe ein
es: insertar tarea

# alignCellSelectionButtonText
source: align cell selection
de: Zell-Selektion ausrichten
es: alinear la selección de celdas

# moveAllSelectionsButtonText
source: move all selections
de: Verschiebe alle Selektionen
es: mover todas las selecciones

# linkWithCellsButtonText
source: link with cells
de: Verknüpfe mit Zellen
es: vínculo con las células

# errNonValidConfigTitle
source: non valid configuration
de: Konfiguration nicht valide
es: configuración no válida

# errNonValidConfigText
source: The selected file does not contain a valid configuration.
de: Die selektierte Datei enthält keine valide Konfiguration.
es: El fichero seleccionado no contiene una configuración válida.

# errNonValidJSONTitle
source: non valid json
de: Json nicht valide
es: json no válido

# errNonValidJSONText
source: The selected file does not contain a valid json.
de: Die selektierte Datei enthält kein valides Json.
es: El archivo seleccionado no contiene un json válido.

# errUnexpectedErrorTitle
source: unexpected error
de: Unerwarteter Fehler
es: error inesperado

# errUnexpectedErrorText
source: An unexpected error occurred : {exception}
de: Ein unerwarteter Fehler ist aufgetreten : {exception}
es: Se ha producido un error inesperado : {exception}

# fileAlreadyExistsTitle
source: file already exists - overwrite it?
de: Datei existiert bereits - überschreiben?
es: El archivo ya existe - ¿lo sobrescribo?

# fileAlreadyExistsText
source: The file already exists, should it be overwritten?
de: Die Datei existiert bereits, soll sie überschrieben werden?
es: El archivo ya existe, ¿hay que sobrescribirlo?

# yesButtonText
source: yes
de: ja
es: sì

# noButtonText
source: no
de: nein

# discardChangesTitle
source: discard changes?
de: Änderungen verwerfen?
es: ¿Descartar cambios?

# discardChangesText
source: Changes have been made in this view. Discard them?
de: Es wurden Änderungen in dieser Ansicht vorgenommen. Sollen diese verworfen werden?
es: Se han realizado cambios en esta vista. ¿Descartarlos?

# duplicateAndMoveCheckboxText
source: move and duplicate
de: verschieben und duplizieren
es: duplicar y mover

# embedLabelText
source: encapsulate
de: verschachteln
es: encapsular

# useCellSelectionLabelText
source: use cell selection
de: verwende Zellen-Selektion
es: usar selección de celdas

# enterValueManuallyLabelText
source: enter value manually
de: Wert manuell eingeben
es: ingresar valor manualmente

# repeatLabelText
source: repeat
de: wiederhole
es: repetir

# manualValueLabelText
source: manual value
de: manueller Wert
es: valor manual
